# Fish
brew 'fish'
brew 'fisher'

# File system
brew 'tree'
brew 'bat'

# Static site generator
brew 'hugo'

# Go
brew 'go'
brew 'golangci-lint'

# Node
brew 'fnm'

# Build tools
brew 'go-task'

# Git
brew 'git'

# Tools
brew 'curl'
brew 'ripgrep'
brew 'htop'
brew 'dasel'
brew 'tmux'
brew 'fzf'
brew 'gping'
brew 'duf'
brew 'hurl'
brew 'zoxide'
brew 'fd'
brew 'xh'
brew 'lsd'
brew 'watchexec'

# TUI
brew 'lazygit'
brew 'lazydocker'

# Editor
cask 'zed'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
