# Dotfiles
brew 'chezmoi'

# Fish
brew 'fish'
brew 'fisher'

# File system
brew 'tree'
brew 'bat'

# Go
brew 'go'
brew 'golangci-lint'
brew 'goreleaser'

# Rust
brew 'rust'

# Node
brew 'nvm'

# Build tools
brew 'go-task'

# Git
brew 'git'
brew 'lazygit'

# Tools
brew 'ripgrep'
brew 'curlie'
brew 'rclone'
brew 'htop'
brew 'dasel'
brew 'tmux'
brew 'fzf'
brew 'gping'
brew 'duf'
brew 'hurl'

# Docker
brew 'lazydocker'
brew 'dive'

# Casks
cask 'wireshark'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono'
